Revit 2027 API
ScheduleDefinition.GetFilters Method
 Gets all filters in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ScheduleFilter> GetFilters()
Public Function GetFilters As IList(Of ScheduleFilter)
public:
IList<ScheduleFilter^>^ GetFilters()
member GetFilters : unit -> IList<ScheduleFilter>
Return Value
IList<ScheduleFilter>
 A list of all filters.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace